app/views/lists/index.html.erb

SELECT "tasks".* FROM "tasks"  WHERE "tasks"."list_id" = ?  [["list_id", 10]]
---

	<% list.tasks.each do |task| %>