app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists"
---
	def index
		respond_with(@lists = List.all)

INSERT INTO "lists" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-09-28 13:08:31.287809"], ["description", "123123"], ["name", "123"], ["updated_at", "2014-09-28 13:08:31.287809"]]
---
	def create
		@list = List.new(params.require(:list).permit(:name))
		if @list.save

SELECT  "lists".* FROM "lists"  WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "lists" SET "description" = ?, "updated_at" = ? WHERE "lists"."id" = 6  [["description", "уууй"], ["updated_at", "2014-09-28 14:03:45.596182"]]
---
	def update
		@list = List.find(params[:id])
		if @list.update_attributes(params.require(:list).permit(:name))

SELECT  "lists".* FROM "lists"  WHERE "lists"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 4]]
---
	def destroy
		@list = List.find(params[:id])
		if @list.destroy