app/controllers/tasks_controller.rb

	def create

	@task = @list.tasks.new(params.require(:task).permit(:name, :description))
	if @task.save
---
INSERT INTO "tasks" ("created_at", "description", "list_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-09-28 16:14:17.142263"], ["description", "111"], ["list_id", 1], ["updated_at", "2014-09-28 16:14:17.142263"]]

def complete
		@list = List.find(params[:list_id])
		@task = @list.tasks.find(params[:id])
		@task.completed = true
		@task.save
---
SELECT  "lists".* FROM "lists"  WHERE "lists"."id" = ? LIMIT 1  [["id", 9]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."list_id" = ? AND "tasks"."id" = ? LIMIT 1  [["list_id", 9], ["id", 4]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = 4  [["completed", "t"], ["updated_at", "2014-09-28 18:38:04.654717"]]

def destroy

		@list = List.find(params[:list_id])
		@task = @list.tasks.find(params[:id])
		if @task.destroy
---
SELECT  "lists".* FROM "lists"  WHERE "lists"."id" = ? LIMIT 1  [["id", 10]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."list_id" = ? AND "tasks"."id" = ? LIMIT 1  [["list_id", 10], ["id", 7]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 7]]

def find_list
	@list = List.find(params[:list_id])
---
SELECT  "lists".* FROM "lists"  WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]